Revit 2021.1 API
FamilyManager Methods
The FamilyManager type exposes the following members.
Methods
Name | Description
AddParameter(ExternalDefinition, BuiltInParameterGroup, Boolean)
Add a new shared parameter to the family.
AddParameter(String, BuiltInParameterGroup, Category, Boolean)
Add a new family type parameter to control the type of a nested family within another family.
AddParameter(String, BuiltInParameterGroup, ParameterType, Boolean)
Add a new family parameter with a given name.
AssociateElementParameterToFamilyParameter
Associates or disassociates the element parameter to an existing family parameter.
CanElementParameterBeAssociated
Indicates if this element parameter can be associated with a family parameter.
DeleteCurrentType
Remove the current family type.
Dispose
Causes the object to release immediately any resources it may be utilizing.
 (Inherited from APIObject.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetAssociatedFamilyParameter
Gets the associated family parameter of an element parameter.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetParameters
 Gets the parameters associated to family types in order.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsParameterLockable
 For Conceptual Mass and Curtain Panel families, indicate whether the specified parameter can be locked.
IsParameterLocked
 For Conceptual Mass and Curtain Panel families, indicate whether the specified dimension-driving parameter is locked.
IsUserAssignableParameterGroup
 Checks if the given parameter group can be assigned to new parameters.
MakeInstance
Set the family parameter as an instance parameter.
MakeNonReporting
Set the reporting family parameter as a regular/driving parameter.
MakeReporting
Set the family parameter as a reporting parameter.
MakeType
Set the family parameter as a type parameter.
NewType
Add a new family type with a given name and makes it be the current type.
RemoveParameter
Remove an existing family parameter from the family.
RenameCurrentType
Rename the current family type.
RenameParameter
Rename a family parameter.
ReorderParameters
 Reorders the family parameters by the specified parameters order.
ReplaceParameter(FamilyParameter, ExternalDefinition, BuiltInParameterGroup, Boolean)
Replace a family parameter with a shared parameter.
ReplaceParameter(FamilyParameter, String, BuiltInParameterGroup, Boolean)
Replace a shared family parameter with a new non-shared family parameter.
Set(FamilyParameter, ElementId)
Set the ElementId value of a family parameter of the current family type.
Set(FamilyParameter, Double)
Set the double value of a family parameter of the current family type.
Set(FamilyParameter, Int32)
Set the integer value of a family parameter of the current family type.
Set(FamilyParameter, String)
Set the string value of a family parameter of the current family type.
SetDescription
Set the description for an existing family parameter. The description will be used as tooltip in the Revit UI including in the properties palette.
SetFormula
Set the formula of a family parameter.
SetParameterLocked
 For Conceptual Mass and Curtain Panel families, lock or unlock a dimension-driving parameter.
SetValueString
Set the string value of a family parameter of the current family type.
SortParameters
 Sorts the family parameters according to the desired sort order.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
FamilyManager Class
Autodesk.Revit.DB Namespace